{"pageProps":{"post":{"id":"5576a3e","tags":[{"content":"bad news","id":"bad-news"},{"content":"good news","id":"good-news"},{"content":"gospel","id":"gospel"},{"content":"salvation","id":"salvation"}],"meta":{"title":"What is the Gospel?","date":"2011-04-28","author":"Jonathan Tsai","tags":"bad news, good news, gospel, salvation"},"content":{"html":"<p>“What is the gospel?” To answer this question succinctly is a very difficult endeavor.</p>\n<p>Depending on a person’s background, there is a way to custom-tailor the presentation of the message of the gospel to him or her.</p>\n<p>Let’s start with a definition and etymology of the word:</p>\n<blockquote>\n<p>The word <em>gospel</em> derives from the Old English <em>gōd-spell</em> (rarely <em>godspel</em>), meaning “good news” or “glad tidings”. It is a calque (word-for-word translation) of the Greek word εὐαγγέλιον, <em>euangelion</em> (eu- “good”, -angelion “message”). The Greek word <em>“euangelion”</em> is also the source (via Latinised “evangelium”) of the terms “evangelist” and “evangelism” in English. The authors of the four canonical Christian gospels are known as the four evangelists. [1]</p>\n</blockquote>\n<p>So the word <em>gospel</em> means “good news.” Generally, in order for there to be good news, by necessity, it must be contrasted with bad news. In light of the Bible, where the gospel message is found, we find that the bad news is exceedingly bad, making the good news incredibly good.</p>\n<p>Therefore, one very coarse outline of the gospel would be:</p>\n<p><strong>1. Bad News</strong></p>\n<p>We were lost in sin (Romans 3:23), dead in our transgressions and trespasses against God, lost without any hope (Isaiah 64:6), doomed to eternal punishment and condemned to eternal hell (Romans 6:23).</p>\n<p><strong>2. Good News</strong></p>\n<p>God Himself made a way for us to be reconciled with Him, through His Son Jesus Christ (John 3:16). That way was through the cross and crucifixion of Jesus, His subsequent death, burial, and resurrection from the dead, and placing our faith and trust in Him that He has died in our place to pay the penalty for our sins, and was raised for our justification (Romans 4:25).</p>\n<p>When I study the message of the gospel, it is amazingly refreshing to my soul. In the near future, I will be sharing some of the things that I’ve discovered (and still am discovering!) from the Bible about different aspects and rich facets of the gospel, and how they have caused me, the sinner, to see the immensity and magnanimity of God and the goodness of God in light of my own utterly repulsive wretchedness.</p>\n<p>Here are a few other places that I’ve found online with the gospel message explained clearly and more in-depth, which you may find as helpful resources:</p>\n<ul>\n<li><a href=\"http://www.matthiasmedia.com.au/2wtl/\">Two Ways To Live</a></li>\n<li><a href=\"http://www.gty.org/search/resources/gospel\">Grace To You</a></li>\n<li><a href=\"http://www.desiringgod.org/resource-library/topic-index/the-gospel\">Desiring God</a></li>\n</ul>\n<ol>\n<li><a href=\"https://en.wikipedia.org/wiki/Gospel#Etymology\">Etymology of “Gospel” on Wikipedia</a></li>\n</ol>\n"}}},"__N_SSG":true}