{"pageProps":{"post":{"id":"c8eab38","tags":[{"content":"obedience","id":"obedience"}],"meta":{"title":"Matthew 21:28-32 – What God Wants","date":"2011-01-20","author":"Jonathan Tsai","tags":"obedience"},"content":{"html":"<p>Passage: Matthew 21:28-32</p>\n<p><strong>The Plot</strong></p>\n<p>This passage tells a story that is quite simple–it doesn’t have a very complicated plot.</p>\n<ul>\n<li>A man had two sons (v. 28)</li>\n<li>The father gave an imperative to both of his sons–“Go work today in the field” (v. 28b, 30)</li>\n<li>Son #1 said “No” at first, but later regretted and obeyed (v. 29)</li>\n<li>Son #2 said “Yes” at first, but ultimately disobeyed (v. 30)</li>\n</ul>\n<p><strong>Basic Listening Comprehension Test</strong></p>\n<p>Next, Jesus asks a question to test the listening comprehension of His audience composed of the chief priests, the elders of the people, and the Pharisees (v. 23, 45)–“Which of the two [sons] did the will of the father?”</p>\n<p>And what did they respond? Surprise, surprise–they passed with flying colors! They responded, “The first [son].”</p>\n<p>What Jesus says next is not a congratulatory remark for their correct understanding of the story, but harsh words of indictment: “Truly I say to you that the tax collectors and prostitutes will get into the kingdom of God before you” (v. 31).</p>\n<p>What? How can that be? How can immoral people such as tax collectors and prostitutes get into the kingdom of God before the righteous (or so they appear to be) Pharisees, elders, and chief priests? What does God want? What is “the will of the Father?” Are God’s standards arbitrary?</p>\n<p>The answer is that God desires repentance that produces genuine obedience, not feigned obedience. When it comes to the economy of God, it is how you finish that matters, not how you start.</p>\n<p><strong>A Warning Against Feigned Obedience</strong></p>\n<p>What does feigned obedience look like? They are: actions which are displeasing to God, yet disguised as piety and reverence for God, but are actually presented before men in order to receive the praises of men.</p>\n<p>There are many serious indictments against feigned obedience in the Bible:</p>\n<p>Matthew 15:7-9 (NASB, c.f. Mark 7:6-8)</p>\n<blockquote>\n<p>You hypocrites, rightly did Isaiah prophesy of you:<br>\n‘THIS PEOPLE HONORS ME WITH THEIR LIPS, BUT THEIR HEART IS FAR AWAY FROM ME.<br>\n‘BUT IN VAIN DO THEY WORSHIP ME, TEACHING AS DOCTRINES THE PRECEPTS OF MEN.'”</p>\n</blockquote>\n<p>Feigned obedience, simply put, is fake, phony, and false obedience.</p>\n<p>Matthew 23:27 (NASB)</p>\n<blockquote>\n<p>Woe to you, scribes and Pharisees, hypocrites! For you are like whitewashed tombs which on the outside appear beautiful, but inside they are full of dead men’s bones and all uncleanness.</p>\n</blockquote>\n<p>Who gives feigned obedience to God? Or if someone gives feigned obedience to God, what does that make him? Scriptures tell us that those who give feigned obedience to God are His <em>enemies</em>.</p>\n<p>Psalm 66:3 (NASB)</p>\n<blockquote>\n<p>Say to God, “How awesome are Your works!<br>\nBecause of the greatness of Your power Your enemies will give feigned obedience to You.</p>\n</blockquote>\n<p>That God is great, awesome, marvelous, and powerful is an undeniable fact to many people–yet for some of those people, they would bother to go to lengths to pretend to obey Him instead of actually doing it.”Do not be deceived, God is not mocked”(Galatians 6:7). If you realize now, be quick to turn and repent, for there is still yet hope; however, if you remain an enemy of God’s, He will certainly crush all His enemies and make them a footstool for His feet (Psalm 110:1).</p>\n<p><strong>Surely not I, Lord?</strong></p>\n<p>Jesus talks of Pharisees not only to provide an example of what to avoid, but also to point out who some of us are.</p>\n<p>I am a Pharisee.</p>\n<p>After Jesus told two parables (vv. 28-31, 33-41) and gave a severe warning (vv. 42-44), the Pharisees “understood that He was speaking about them” (Matthew 21:45). Not surprisingly, their response was that of resentment rather than remorse.</p>\n<p>Disobedience toward God, stated more harshly, is defiance–and the consequence facing anyone who has the audacity to defy God is terrifying: “He will bring those wretches to a wretched end” (v. 41; c.f. Hebrews 10:31).</p>\n<p>O, would that God grant us the grace to obey Him!</p>\n"}}},"__N_SSG":true}