{"pageProps":{"post":{"id":"ca73620","tags":[{"content":"folly","id":"folly"},{"content":"foolishness","id":"foolishness"},{"content":"greed","id":"greed"},{"content":"sin","id":"sin"}],"meta":{"title":"Luke 12:15-21 – Don’t Waste Your Life","date":"2010-03-31","author":"Jonathan Tsai","tags":"folly, foolishness, greed, sin"},"content":{"html":"<p>Passage: Luke 12:15-21</p>\n<p>The rapper Lecrae mentions this passage in his song with the same title; one of the most influential Christian books in my life was John Piper’s book of the same name:</p>\n<p>DON’T WASTE YOUR LIFE</p>\n<p>In this passage, Jesus teaches that every form of greed is dangerous and deadly. It is a waste of life. Greed is dangerous and deadly because even when greed is satisfied and fulfilled, when an abundance is had, the greedy individual is blinded to the condition of his soul. He is a ripe candidate for becoming Satan’s latest victim among millions (if not billions), and is just asking to be devoured by the prowling and roaring lion (1 Peter 5:8).</p>\n<p>The greedy man is like the naive young man who listens to the woman of folly rather than voice of wisdom (Proverbs 9:18). Using an analogy from a children’s tale, Hansel and Gretel, the man of greed is like the naive children who are lured into the house of candy and cake occupied by the child-devouring witch.</p>\n<p>Jesus sums up the story that He just told in this passage with one hard-hitting punch line, equating the rich man with an eternal fool:</p>\n<blockquote>\n<p>So is the man who stores up treasure for himself, and is not rich toward God.</p>\n</blockquote>\n<p>Since we know that Satan, the enemy, is exceedingly wise–he is thousands of years old, was created before the first man, Adam, and has seen the rise and fall of many human civilizations, we know that his schemes are all too crafty (Ephesians 6:11) and his wiles all too deceitful. He is the tempter (Matthew 4:3) and the accuser (Revelation 12:10). From one man, Satan may withhold material goods, and so tempt him to despise and blame God for his lack; from another, Satan may give so abundantly that he becomes so full, so fat, and so rich, that he denies God (Proverbs 30:9). Against such a formidable foe, who can stand a chance?</p>\n<p><strong>Quick Recap</strong></p>\n<p>I wanted to give a quick recap about the purpose of my writings. It is not simply to analyze Scripture and to add to head-knowledge. It is an exercise for me to know and love God’s word, and to practice delighting in the wonders of His law (Psalm 119:18), and to teach my heart and my soul to love God and worship Him in awe and reverence. So the question that must be asked of myself every time I read the Bible–how does what I just read point me to worship God?</p>\n<p>I am thankful for this passage because Jesus loves us very much. He loves me very much, because if it were not for Him and these words of His, I would be like the unwary fat kid trapped in the evil witch’s house. This passage reminds me that if it were not for Jesus Christ my Advocate before the Father (1 John 2:1), I would stand guilty in this sin, and have to be eternally punished. Furthermore, having been justified already in Christ (Romans 5:9), this passage teaches me the very thing to avoid, whereas if I were to pursue it, I would waste my life.</p>\n<p>We can stand far off as an observer and gawk at the folly of the rich fool, but who has ever told me, “You are that fool!”? Apart from the revelation of God’s word, no one else has ever pointed out to me that my soul was fast on its way to hell; not only has Jesus Christ pointed out the error of my ways, He has also paid the penalty for my transgressions against Him. Praise and thanks be unto Him!</p>\n"}}},"__N_SSG":true}