{"pageProps":{"post":{"id":"a180b1f","meta":{"title":"1 Kings 18:21 - If the LORD is God","date":"2009-06-12","author":"Jonathan Tsai"},"content":{"html":"<p>Passage: 1 Kings 18:21 (Context: 1 Kings 18:17-40)</p>\n<p>If. IF?! What does Elijah mean by saying, “If the LORD is God. . .” I mean, isn’t He?</p>\n<p>This was the final showdown. An experiment would be performed, and the results would set the facts straight, once and for all. Who is God? Is it Yahweh, the Creator of heaven and earth and the Sovereign benefactor of Israel, or Baal, some piece-of-junk idol? No more being wishy-washy, or as Elijah puts it, “hesitating between two opinions.”</p>\n<p>“The ball is in your court,” says Elijah, “You decide.” I think it’s a close one! It’s really hard to tell, because these two contenders look pretty strong for winning the “Who is God?” contest. In one corner of the ring, we have the LORD, who hamstrung Pharaoh’s army, plundered and devastated the Egyptians, and delivered Israel through the sea on dry land, and who did much more; in the other corner, we have Baal, the deaf and mute idol to whom you offer your children as sacrifices and burnt offerings.</p>\n<p>Are you KIDDING me?</p>\n<p>That the ruler of the universe would stoop down to be measured by deficient human standards and allow Himself to be the subject of an experiment is a humongous slap in the face to us, condemning us of our wickedness. The LORD, the only true God, is the only One who is worthy of worship and has the right to demand it as well (Philippians 2:10-11).</p>\n<p>The LORD is God. Truth. Fact. Tautology. Does not need to be proven. It is the basis on which other proofs are made.</p>\n<p>Elijah made such a ridiculous and absurd statement in the first place, “If the LORD is God, follow Him,” to show how ridiculous and absurd Israel was. And thousands of years later, I can see us in their situation. God is God, but sometimes we treat Him as God with a little “g,” and we put other gods in our lives, following them. Shame on us.</p>\n<p>Since the LORD is God, follow Him.</p>\n"}}},"__N_SSG":true}