{"pageProps":{"post":{"id":"511a5ed","meta":{"title":"Psalm 100 – Call to Worship","date":"2012-02-12","author":"Jonathan Tsai"},"content":{"html":"<p>Passage: Psalm 100</p>\n<p>According to the Bible, the title for this psalm is “A Psalm for Thanksgiving.”</p>\n<p>A psalm is a song, and this psalm is not just any song–it is a call to action; it is a call to <strong>worship</strong>. Thanksgiving, or giving of thanks to God, is one of the purest forms of worship.</p>\n<p>Whenever I am lost in my thoughts and my heart is wild and chaotic and reluctant to worship God–and I soon realize this by God’s grace–I turn to Psalm 100 to guide myself, the creature, to the rightful place before my Creator–humbled and prostrated low.</p>\n<p>I love the Psalms because nearly every call to worship in this book is coupled with a reason, explanation, or justification to make the call more pertinent and urgent to the ones who are being called.</p>\n<p>Here is the psalm with the imperative verbs emphasized–these are the calls to action:</p>\n<blockquote>\n<p>(1) <strong>Shout</strong> joyfully to the LORD, all the earth.<br>\n(2) <strong>Serve</strong> the LORD with gladness;<br>\n<strong>Come</strong> before Him with joyful singing.<br>\n(3) <strong>Know</strong> <strong>that</strong> the LORD Himself is God;<br>\nIt is He who has made us, and not we ourselves;<br>\nWe are His people and the sheep of His pasture.<br>\n(4) <strong>Enter</strong> His gates with thanksgiving<br>\nAnd His courts with praise.<br>\n<strong>Give thanks</strong> to Him, bless His name.<br>\n(5) <strong>For</strong> the LORD is good;<br>\nHis lovingkindness is everlasting<br>\nAnd His faithfulness to all generations.</p>\n</blockquote>\n<p>Now look at this passage with most of the direct objects removed:</p>\n<blockquote>\n<p><strong>Shout joyfully</strong>, all the earth. <strong>Serve with gladness. Come with joyful singing. Know</strong> (that God is God and we are His creation). <strong>Enter</strong> (His presence) <strong>with thanksgiving and praise. Give thanks</strong> (to God) <strong>and bless</strong> (the name of God).</p>\n</blockquote>\n<p>When the direct objects of those verbs were left out, the commands become extremely confusing. Insert the direct objects again, and the motivation becomes painstakingly clear. In fact, any other object besides God would not be worthy of such worship and adoration.</p>\n<p>It is God whom we are called to worship. It is God whom we are called to shout joyfully to along with the entire population of the earth; it is God whom we are called to serve with gladness; it is God whom we are called to approach with joyful singing. We are called to know that the LORD, YHWH, is God. We are called to know that <a href=\"/blog/psalm-139-14-fearfully-and-wonderfully-made-part-1-a5f7686\">God made us with His own hands</a> (c.f. Psalm 139:13-16), and that we did not spontaneously generate. We are called to know that we are God’s rightful possession. We sheep who have gone astray (c.f. Isaiah 53:6) are called to know that the LORD God is our Shepherd–so good that He lays down His life for us (John 10:11).</p>\n<p>Note in verse 3 that the call to know God and know about His works is the longest verse in this Psalm. God wants us to make knowledge of the truth the basis of our worship. It is no coincidence that Jesus prayed, “Sanctify them in the truth; Your word is truth” (John 17:17).</p>\n<p>Next, the psalmist calls us to approach God with thanksgiving and praise. In the days when the tabernacle or temple worship set up by Solomon in Jerusalem was still around, God’s presence was literally there in the Holy of Holies (c.f. Hebrews 9:3), so there was actually a gate at the temple to enter through, and an actual temple courtyard where people congregated for worship. While we may no longer have access to the temple in Jerusalem, we actually have something greater (c.f. Hebrews 9:11, 2 Corinthians 16:16, Psalm 139:7-9).</p>\n<p>After that, the psalmist calls us to direct our thanks and blessing toward God. Finally, the psalmist concludes this call to worship by telling us about God’s characters and qualities–His goodness, lovingkindness, and faithfulness. Is God good? Yes, God is absolutely and exceedingly good. For what duration does God demonstrate His lovingkindness–His love, mercy, grace, patience, kindness? Forever. For how long is God faithful to His people? To all generations (c.f. Psalm 145:3-5). The reader or hearer of Psalm 100, having no questions left unanswered, should be imparted a crystal clear understanding of why the call to worship God is so compelling.</p>\n<p>I hope and pray that I would respond in obedience to this call to worship God, and that you would as well.</p>\n"}}},"__N_SSG":true}