{"pageProps":{"postData":{"id":"help_me_o_my_creator","contentHtml":"<p>Passage: Psalm 119:73</p>\n<p>This verse is found in the middle of the longest chapter in the Bible, Psalm 119. As the editors of the particular Bible in front of me noted in the section heading, Psalm 119 is a collection of “Meditations and Prayers Relating to the Law of God.”</p>\n<p>The reader can find much encouragement in peering into the devotional life of this psalmist, and learn much as a worshiper of how he may rightly and reverently worship his God.</p>\n<p>The psalmist utters a prayer that exalts God and puts himself in his rightful place–a creature in utter dependence upon his Creator.</p>\n<p>In the first part of this prayer, the psalmist recognizes that God is his Creator (cf. Psalm 139:13-16)</p>\n<blockquote>\n<p>Your hands made me and fashioned me</p>\n</blockquote>\n<p>The second part of prayer lays out the psalmist’s petition:</p>\n<blockquote>\n<p>Give me understanding</p>\n</blockquote>\n<p>Lastly, the psalmist gives his reason, his desire, for making this request:</p>\n<blockquote>\n<p>that I may learn Your commandments</p>\n</blockquote>\n<p>A modern day analogy to help us understand this psalmist’s prayer may be the Apple Computer company. Since Apple is the manufacturer of the hardware of the computers and devices they sell, they are known also for making the best software for it, because they know its inner workings and how to optimize the software to be a perfect match for the hardware. If an Apple MacBook owner is looking for a particular program for editing media, one of the best places to obtain what he is seeking for is at the Apple store–the official distributor for Apple software. The MacBook owner would probably not go to the local mom and pop computer repair store.</p>\n<p>God has given many promises to us in His word regarding His faithfulness to answer our prayers when we pray according to His will (John 15:7), and He has also told us that He is a good Father who gives good gifts to His children (Matthew 7:7-11).</p>\n<p>For all believers, both young and old, mature and new to the faith, it is entirely appropriate to pray with dependency and expectancy to God for a heart of understanding toward God and His word. It is good and desirable to know God and understand Him (Proverbs 9:10)–His will, His character, His works, and everything about Him.</p>\n<p>The problem for many believers, including myself, who at times find themselves struggling with immaturity, lack of understanding of God’s word, and slowness to obey Him, is often caused by a lack of prayer and trust in God (James 4:2).</p>\n<p>If our computer gets infected with a virus and we have all kinds of problems operating it subsequently, would we not go to our computer-expert friends for help? Surely, they would be able to clean up the computer, or format your computer and install a fresh operating system on it.</p>\n<p>If God, who was able to fashion the heavens and the earth, and all living creatures including your very being–the external parts and the outer “shell” of your body (arms, legs, hands, feet, eyes, ears, nose, brain, organs, etc)–and did so, could He not also change your heart? He can install whatever software He wants in your heart–all you  have to do is ask.</p>\n","title":"Psalm 119:73 - Help Me, O My Creator","date":"2010-01-10","author":"Jonathan Tsai"}},"__N_SSG":true}